---
type: BaseExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 19
tags: [revit-api, class]
---

# BaseExportOptions

`Autodesk.Revit.DB.BaseExportOptions` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetExportFontTable | 2013 | `public ExportFontTable GetExportFontTable ()` |
| Method | GetExportLayerTable | 2014 | `public ExportLayerTable GetExportLayerTable ()` |
| Method | GetExportLinetypeTable | 2014 | `public ExportLinetypeTable GetExportLinetypeTable ()` |
| Method | GetExportPatternTable | 2014 | `public ExportPatternTable GetExportPatternTable ()` |
| Method | GetPredefinedSetupNames | 2013 | `public static IList < string > GetPredefinedSetupNames ( Document document )` |
| Method | SetExportFontTable | 2013 | `public void SetExportFontTable ( ExportFontTable fontTable )` |
| Method | SetExportLayerTable | 2014 | `public void SetExportLayerTable ( ExportLayerTable layerTable )` |
| Method | SetExportLinetypeTable | 2014 | `public void SetExportLinetypeTable ( ExportLinetypeTable linetypeTable )` |
| Method | SetExportPatternTable | 2014 | `public void SetExportPatternTable ( ExportPatternTable patternTable )` |
| Property | Colors | 2013 | `public ExportColorMode Colors { get ; set ; }` |
| Property | HatchPatternsFileName | 2013 | `public string HatchPatternsFileName { get ; set ; }` |
| Property | HideReferencePlane | 2013 | `public bool HideReferencePlane { get ; set ; }` |
| Property | HideScopeBox | 2013 | `public bool HideScopeBox { get ; set ; }` |
| Property | HideUnreferenceViewTags | 2013 | `public bool HideUnreferenceViewTags { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LayerMapping | 2013 | `public string LayerMapping { get ; set ; }` |
| Property | PreserveCoincidentLines | 2015 Subscription Update | `public bool PreserveCoincidentLines { get ; set ; }` |
| Property | PropOverrides | 2013 | `public PropOverrideMode PropOverrides { get ; set ; }` |